Show / Hide Table of Contents
Class RebarHookBend
Represents a bend rebar hook in 3D.
Inheritance
System.Object
OpenObject
RebarHookBase
RebarHookBend
Inherited Members
 RebarHookBase.AxisY
 RebarHookBase.Reverse
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public class RebarHookBend : RebarHookBase
Properties
Improve this Doc   View Source
Angle
Bending Angle in X-Y Plane.
Declaration
public double Angle { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Length
Length of the Hook.
Declaration
public double Length { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Radius
Bending Radius. It will override Vertex Radius in case of RebarArcRadVertex3D and RebarArcRadVertex3D.
Declaration
public double Radius { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source